In [2]:
import sqlite3
import pandas as pd
import numpy as np

In [15]:
con = sqlite3.connect('db')

In [16]:
d = {'id': [0, 1, 2, 3, 4, 5, 6, 7, 8], 
     'company': [4, 4, 3, 3, 2, 2, 1, 1, 1], 
     'plane': ['B', 'B', 'T', 'T', 'I', 'I', 'U', 'U' 'U', 'U'], 
     'from': ['R', 'P', 'R', 'V', 'M', 'R', 'R', 'M' 'R', 'R'], 
     'to': ['P', 'R', 'V', 'R', 'R', 'M', 'M', 'M' 'R', 'R']}
df = pd.DataFrame(d, index=[0, 1, 2, 3, 4, 5, 6, 7, 8])
df.head(1)

   id  company plane from to
0   0        4     B    R  P

In [21]:
df.to_sql('test', con, index=False, if_exists='replace')

9

In [22]:
def select(sql):
    return pd.read_sql(sql, con)

In [23]:
select('SELECT* FROM test')

   id  company plane from  to
0   0        4     B    R   P
1   1        4     B    P   R
2   2        3     T    R   V
3   3        3     T    V   R
4   4        2     I    M   R
5   5        2     I    R   M
6   6        1     U    R   M
7   7        1    UU   MR  MR
8   8        1     U    R   R